stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba64xx.h
/*******************  Bit definition for FLASH_PRIVBB2R3 register  ******************/
#define FLASH_PRIVBB2R3_PRIVBB0_Pos                   (0UL)
#define FLASH_PRIVBB2R3_PRIVBB0_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB0_Pos)            /*!< 0x00000001 */
#define FLASH_PRIVBB2R3_PRIVBB0                       FLASH_PRIVBB2R3_PRIVBB0_Msk                       /*!< Page 64 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB1_Pos                   (1UL)
#define FLASH_PRIVBB2R3_PRIVBB1_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB1_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVBB2R3_PRIVBB1                       FLASH_PRIVBB2R3_PRIVBB1_Msk                       /*!< Page 65 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB2_Pos                   (2UL)
#define FLASH_PRIVBB2R3_PRIVBB2_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB2_Pos)            /*!< 0x00000004 */
#define FLASH_PRIVBB2R3_PRIVBB2                       FLASH_PRIVBB2R3_PRIVBB2_Msk                       /*!< Page 66 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB3_Pos                   (3UL)
#define FLASH_PRIVBB2R3_PRIVBB3_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB3_Pos)            /*!< 0x00000008 */
#define FLASH_PRIVBB2R3_PRIVBB3                       FLASH_PRIVBB2R3_PRIVBB3_Msk                       /*!< Page 67 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB4_Pos                   (4UL)
#define FLASH_PRIVBB2R3_PRIVBB4_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB4_Pos)            /*!< 0x00000010 */
#define FLASH_PRIVBB2R3_PRIVBB4                       FLASH_PRIVBB2R3_PRIVBB4_Msk                       /*!< Page 68 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB5_Pos                   (5UL)
#define FLASH_PRIVBB2R3_PRIVBB5_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB5_Pos)            /*!< 0x00000020 */
#define FLASH_PRIVBB2R3_PRIVBB5                       FLASH_PRIVBB2R3_PRIVBB5_Msk                       /*!< Page 69 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB6_Pos                   (6UL)
#define FLASH_PRIVBB2R3_PRIVBB6_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB6_Pos)            /*!< 0x00000040 */
#define FLASH_PRIVBB2R3_PRIVBB6                       FLASH_PRIVBB2R3_PRIVBB6_Msk                       /*!< Page 70 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB7_Pos                   (7UL)
#define FLASH_PRIVBB2R3_PRIVBB7_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB7_Pos)            /*!< 0x00000080 */
#define FLASH_PRIVBB2R3_PRIVBB7                       FLASH_PRIVBB2R3_PRIVBB7_Msk                       /*!< Page 71 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB8_Pos                   (8UL)
#define FLASH_PRIVBB2R3_PRIVBB8_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB8_Pos)            /*!< 0x00000100 */
#define FLASH_PRIVBB2R3_PRIVBB8                       FLASH_PRIVBB2R3_PRIVBB8_Msk                       /*!< Page 72 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB9_Pos                   (9UL)
#define FLASH_PRIVBB2R3_PRIVBB9_Msk                   (0x1UL << FLASH_PRIVBB2R3_PRIVBB9_Pos)            /*!< 0x00000200 */
#define FLASH_PRIVBB2R3_PRIVBB9                       FLASH_PRIVBB2R3_PRIVBB9_Msk                       /*!< Page 73 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB10_Pos                  (10UL)
#define FLASH_PRIVBB2R3_PRIVBB10_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB10_Pos)           /*!< 0x00000400 */
#define FLASH_PRIVBB2R3_PRIVBB10                      FLASH_PRIVBB2R3_PRIVBB10_Msk                      /*!< Page 74 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB11_Pos                  (11UL)
#define FLASH_PRIVBB2R3_PRIVBB11_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB11_Pos)           /*!< 0x00000800 */
#define FLASH_PRIVBB2R3_PRIVBB11                      FLASH_PRIVBB2R3_PRIVBB11_Msk                      /*!< Page 75 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB12_Pos                  (12UL)
#define FLASH_PRIVBB2R3_PRIVBB12_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB12_Pos)           /*!< 0x00001000 */
#define FLASH_PRIVBB2R3_PRIVBB12                      FLASH_PRIVBB2R3_PRIVBB12_Msk                      /*!< Page 76 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB13_Pos                  (13UL)
#define FLASH_PRIVBB2R3_PRIVBB13_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB13_Pos)           /*!< 0x00002000 */
#define FLASH_PRIVBB2R3_PRIVBB13                      FLASH_PRIVBB2R3_PRIVBB13_Msk                      /*!< Page 77 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB14_Pos                  (14UL)
#define FLASH_PRIVBB2R3_PRIVBB14_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB14_Pos)           /*!< 0x00004000 */
#define FLASH_PRIVBB2R3_PRIVBB14                      FLASH_PRIVBB2R3_PRIVBB14_Msk                      /*!< Page 78 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB15_Pos                  (15UL)
#define FLASH_PRIVBB2R3_PRIVBB15_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB15_Pos)           /*!< 0x00008000 */
#define FLASH_PRIVBB2R3_PRIVBB15                      FLASH_PRIVBB2R3_PRIVBB15_Msk                      /*!< Page 79 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB16_Pos                  (16UL)
#define FLASH_PRIVBB2R3_PRIVBB16_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB16_Pos)           /*!< 0x00010000 */
#define FLASH_PRIVBB2R3_PRIVBB16                      FLASH_PRIVBB2R3_PRIVBB16_Msk                      /*!< Page 80 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB17_Pos                  (17UL)
#define FLASH_PRIVBB2R3_PRIVBB17_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB17_Pos)           /*!< 0x00020000 */
#define FLASH_PRIVBB2R3_PRIVBB17                      FLASH_PRIVBB2R3_PRIVBB17_Msk                      /*!< Page 81 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB18_Pos                  (18UL)
#define FLASH_PRIVBB2R3_PRIVBB18_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB18_Pos)           /*!< 0x00040000 */
#define FLASH_PRIVBB2R3_PRIVBB18                      FLASH_PRIVBB2R3_PRIVBB18_Msk                      /*!< Page 82 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB19_Pos                  (19UL)
#define FLASH_PRIVBB2R3_PRIVBB19_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB19_Pos)           /*!< 0x00080000 */
#define FLASH_PRIVBB2R3_PRIVBB19                      FLASH_PRIVBB2R3_PRIVBB19_Msk                      /*!< Page 83 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB20_Pos                  (20UL)
#define FLASH_PRIVBB2R3_PRIVBB20_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB20_Pos)           /*!< 0x00100000 */
#define FLASH_PRIVBB2R3_PRIVBB20                      FLASH_PRIVBB2R3_PRIVBB20_Msk                      /*!< Page 84 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB21_Pos                  (21UL)
#define FLASH_PRIVBB2R3_PRIVBB21_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB21_Pos)           /*!< 0x00200000 */
#define FLASH_PRIVBB2R3_PRIVBB21                      FLASH_PRIVBB2R3_PRIVBB21_Msk                      /*!< Page 85 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB22_Pos                  (22UL)
#define FLASH_PRIVBB2R3_PRIVBB22_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB22_Pos)           /*!< 0x00400000 */
#define FLASH_PRIVBB2R3_PRIVBB22                      FLASH_PRIVBB2R3_PRIVBB22_Msk                      /*!< Page 86 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB23_Pos                  (23UL)
#define FLASH_PRIVBB2R3_PRIVBB23_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB23_Pos)           /*!< 0x00800000 */
#define FLASH_PRIVBB2R3_PRIVBB23                      FLASH_PRIVBB2R3_PRIVBB23_Msk                      /*!< Page 87 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB24_Pos                  (24UL)
#define FLASH_PRIVBB2R3_PRIVBB24_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB24_Pos)           /*!< 0x01000000 */
#define FLASH_PRIVBB2R3_PRIVBB24                      FLASH_PRIVBB2R3_PRIVBB24_Msk                      /*!< Page 88 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB25_Pos                  (25UL)
#define FLASH_PRIVBB2R3_PRIVBB25_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB25_Pos)           /*!< 0x02000000 */
#define FLASH_PRIVBB2R3_PRIVBB25                      FLASH_PRIVBB2R3_PRIVBB25_Msk                      /*!< Page 89 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB26_Pos                  (26UL)
#define FLASH_PRIVBB2R3_PRIVBB26_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB26_Pos)           /*!< 0x04000000 */
#define FLASH_PRIVBB2R3_PRIVBB26                      FLASH_PRIVBB2R3_PRIVBB26_Msk                      /*!< Page 90 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB27_Pos                  (27UL)
#define FLASH_PRIVBB2R3_PRIVBB27_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB27_Pos)           /*!< 0x08000000 */
#define FLASH_PRIVBB2R3_PRIVBB27                      FLASH_PRIVBB2R3_PRIVBB27_Msk                      /*!< Page 91 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB28_Pos                  (28UL)
#define FLASH_PRIVBB2R3_PRIVBB28_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB28_Pos)           /*!< 0x10000000 */
#define FLASH_PRIVBB2R3_PRIVBB28                      FLASH_PRIVBB2R3_PRIVBB28_Msk                      /*!< Page 92 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB29_Pos                  (29UL)
#define FLASH_PRIVBB2R3_PRIVBB29_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB29_Pos)           /*!< 0x20000000 */
#define FLASH_PRIVBB2R3_PRIVBB29                      FLASH_PRIVBB2R3_PRIVBB29_Msk                      /*!< Page 93 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB30_Pos                  (30UL)
#define FLASH_PRIVBB2R3_PRIVBB30_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB30_Pos)           /*!< 0x40000000 */
#define FLASH_PRIVBB2R3_PRIVBB30                      FLASH_PRIVBB2R3_PRIVBB30_Msk                      /*!< Page 94 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R3_PRIVBB31_Pos                  (31UL)
#define FLASH_PRIVBB2R3_PRIVBB31_Msk                  (0x1UL << FLASH_PRIVBB2R3_PRIVBB31_Pos)           /*!< 0x80000000 */
#define FLASH_PRIVBB2R3_PRIVBB31                      FLASH_PRIVBB2R3_PRIVBB31_Msk                      /*!< Page 95 in Flash bank 2 only accessible by privileged access */

/*******************  Bit definition for FLASH_PRIVBB2R4 register  ******************/
#define FLASH_PRIVBB2R4_PRIVBB0_Pos                   (0UL)
#define FLASH_PRIVBB2R4_PRIVBB0_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB0_Pos)            /*!< 0x00000001 */
#define FLASH_PRIVBB2R4_PRIVBB0                       FLASH_PRIVBB2R4_PRIVBB0_Msk                       /*!< Page 96 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB1_Pos                   (1UL)
#define FLASH_PRIVBB2R4_PRIVBB1_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB1_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVBB2R4_PRIVBB1                       FLASH_PRIVBB2R4_PRIVBB1_Msk                       /*!< Page 97 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB2_Pos                   (2UL)
#define FLASH_PRIVBB2R4_PRIVBB2_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB2_Pos)            /*!< 0x00000004 */
#define FLASH_PRIVBB2R4_PRIVBB2                       FLASH_PRIVBB2R4_PRIVBB2_Msk                       /*!< Page 98 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB3_Pos                   (3UL)
#define FLASH_PRIVBB2R4_PRIVBB3_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB3_Pos)            /*!< 0x00000008 */
#define FLASH_PRIVBB2R4_PRIVBB3                       FLASH_PRIVBB2R4_PRIVBB3_Msk                       /*!< Page 99 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB4_Pos                   (4UL)
#define FLASH_PRIVBB2R4_PRIVBB4_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB4_Pos)            /*!< 0x00000010 */
#define FLASH_PRIVBB2R4_PRIVBB4                       FLASH_PRIVBB2R4_PRIVBB4_Msk                       /*!< Page 100 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB5_Pos                   (5UL)
#define FLASH_PRIVBB2R4_PRIVBB5_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB5_Pos)            /*!< 0x00000020 */
#define FLASH_PRIVBB2R4_PRIVBB5                       FLASH_PRIVBB2R4_PRIVBB5_Msk                       /*!< Page 101 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB6_Pos                   (6UL)
#define FLASH_PRIVBB2R4_PRIVBB6_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB6_Pos)            /*!< 0x00000040 */
#define FLASH_PRIVBB2R4_PRIVBB6                       FLASH_PRIVBB2R4_PRIVBB6_Msk                       /*!< Page 102 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB7_Pos                   (7UL)
#define FLASH_PRIVBB2R4_PRIVBB7_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB7_Pos)            /*!< 0x00000080 */
#define FLASH_PRIVBB2R4_PRIVBB7                       FLASH_PRIVBB2R4_PRIVBB7_Msk                       /*!< Page 103 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB8_Pos                   (8UL)
#define FLASH_PRIVBB2R4_PRIVBB8_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB8_Pos)            /*!< 0x00000100 */
#define FLASH_PRIVBB2R4_PRIVBB8                       FLASH_PRIVBB2R4_PRIVBB8_Msk                       /*!< Page 104 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB9_Pos                   (9UL)
#define FLASH_PRIVBB2R4_PRIVBB9_Msk                   (0x1UL << FLASH_PRIVBB2R4_PRIVBB9_Pos)            /*!< 0x00000200 */
#define FLASH_PRIVBB2R4_PRIVBB9                       FLASH_PRIVBB2R4_PRIVBB9_Msk                       /*!< Page 105 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB10_Pos                  (10UL)
#define FLASH_PRIVBB2R4_PRIVBB10_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB10_Pos)           /*!< 0x00000400 */
#define FLASH_PRIVBB2R4_PRIVBB10                      FLASH_PRIVBB2R4_PRIVBB10_Msk                      /*!< Page 106 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB11_Pos                  (11UL)
#define FLASH_PRIVBB2R4_PRIVBB11_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB11_Pos)           /*!< 0x00000800 */
#define FLASH_PRIVBB2R4_PRIVBB11                      FLASH_PRIVBB2R4_PRIVBB11_Msk                      /*!< Page 107 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB12_Pos                  (12UL)
#define FLASH_PRIVBB2R4_PRIVBB12_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB12_Pos)           /*!< 0x00001000 */
#define FLASH_PRIVBB2R4_PRIVBB12                      FLASH_PRIVBB2R4_PRIVBB12_Msk                      /*!< Page 108 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB13_Pos                  (13UL)
#define FLASH_PRIVBB2R4_PRIVBB13_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB13_Pos)           /*!< 0x00002000 */
#define FLASH_PRIVBB2R4_PRIVBB13                      FLASH_PRIVBB2R4_PRIVBB13_Msk                      /*!< Page 109 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB14_Pos                  (14UL)
#define FLASH_PRIVBB2R4_PRIVBB14_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB14_Pos)           /*!< 0x00004000 */
#define FLASH_PRIVBB2R4_PRIVBB14                      FLASH_PRIVBB2R4_PRIVBB14_Msk                      /*!< Page 110 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB15_Pos                  (15UL)
#define FLASH_PRIVBB2R4_PRIVBB15_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB15_Pos)           /*!< 0x00008000 */
#define FLASH_PRIVBB2R4_PRIVBB15                      FLASH_PRIVBB2R4_PRIVBB15_Msk                      /*!< Page 111 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB16_Pos                  (16UL)
#define FLASH_PRIVBB2R4_PRIVBB16_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB16_Pos)           /*!< 0x00010000 */
#define FLASH_PRIVBB2R4_PRIVBB16                      FLASH_PRIVBB2R4_PRIVBB16_Msk                      /*!< Page 112 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB17_Pos                  (17UL)
#define FLASH_PRIVBB2R4_PRIVBB17_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB17_Pos)           /*!< 0x00020000 */
#define FLASH_PRIVBB2R4_PRIVBB17                      FLASH_PRIVBB2R4_PRIVBB17_Msk                      /*!< Page 113 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB18_Pos                  (18UL)
#define FLASH_PRIVBB2R4_PRIVBB18_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB18_Pos)           /*!< 0x00040000 */
#define FLASH_PRIVBB2R4_PRIVBB18                      FLASH_PRIVBB2R4_PRIVBB18_Msk                      /*!< Page 114 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB19_Pos                  (19UL)
#define FLASH_PRIVBB2R4_PRIVBB19_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB19_Pos)           /*!< 0x00080000 */
#define FLASH_PRIVBB2R4_PRIVBB19                      FLASH_PRIVBB2R4_PRIVBB19_Msk                      /*!< Page 115 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB20_Pos                  (20UL)
#define FLASH_PRIVBB2R4_PRIVBB20_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB20_Pos)           /*!< 0x00100000 */
#define FLASH_PRIVBB2R4_PRIVBB20                      FLASH_PRIVBB2R4_PRIVBB20_Msk                      /*!< Page 116 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB21_Pos                  (21UL)
#define FLASH_PRIVBB2R4_PRIVBB21_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB21_Pos)           /*!< 0x00200000 */
#define FLASH_PRIVBB2R4_PRIVBB21                      FLASH_PRIVBB2R4_PRIVBB21_Msk                      /*!< Page 117 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB22_Pos                  (22UL)
#define FLASH_PRIVBB2R4_PRIVBB22_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB22_Pos)           /*!< 0x00400000 */
#define FLASH_PRIVBB2R4_PRIVBB22                      FLASH_PRIVBB2R4_PRIVBB22_Msk                      /*!< Page 118 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB23_Pos                  (23UL)
#define FLASH_PRIVBB2R4_PRIVBB23_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB23_Pos)           /*!< 0x00800000 */
#define FLASH_PRIVBB2R4_PRIVBB23                      FLASH_PRIVBB2R4_PRIVBB23_Msk                      /*!< Page 119 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB24_Pos                  (24UL)
#define FLASH_PRIVBB2R4_PRIVBB24_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB24_Pos)           /*!< 0x01000000 */
#define FLASH_PRIVBB2R4_PRIVBB24                      FLASH_PRIVBB2R4_PRIVBB24_Msk                      /*!< Page 120 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB25_Pos                  (25UL)
#define FLASH_PRIVBB2R4_PRIVBB25_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB25_Pos)           /*!< 0x02000000 */
#define FLASH_PRIVBB2R4_PRIVBB25                      FLASH_PRIVBB2R4_PRIVBB25_Msk                      /*!< Page 121 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB26_Pos                  (26UL)
#define FLASH_PRIVBB2R4_PRIVBB26_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB26_Pos)           /*!< 0x04000000 */
#define FLASH_PRIVBB2R4_PRIVBB26                      FLASH_PRIVBB2R4_PRIVBB26_Msk                      /*!< Page 122 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB27_Pos                  (27UL)
#define FLASH_PRIVBB2R4_PRIVBB27_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB27_Pos)           /*!< 0x08000000 */
#define FLASH_PRIVBB2R4_PRIVBB27                      FLASH_PRIVBB2R4_PRIVBB27_Msk                      /*!< Page 123 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB28_Pos                  (28UL)
#define FLASH_PRIVBB2R4_PRIVBB28_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB28_Pos)           /*!< 0x10000000 */
#define FLASH_PRIVBB2R4_PRIVBB28                      FLASH_PRIVBB2R4_PRIVBB28_Msk                      /*!< Page 124 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB29_Pos                  (29UL)
#define FLASH_PRIVBB2R4_PRIVBB29_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB29_Pos)           /*!< 0x20000000 */
#define FLASH_PRIVBB2R4_PRIVBB29                      FLASH_PRIVBB2R4_PRIVBB29_Msk                      /*!< Page 125 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB30_Pos                  (30UL)
#define FLASH_PRIVBB2R4_PRIVBB30_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB30_Pos)           /*!< 0x40000000 */
#define FLASH_PRIVBB2R4_PRIVBB30                      FLASH_PRIVBB2R4_PRIVBB30_Msk                      /*!< Page 126 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R4_PRIVBB31_Pos                  (31UL)
#define FLASH_PRIVBB2R4_PRIVBB31_Msk                  (0x1UL << FLASH_PRIVBB2R4_PRIVBB31_Pos)           /*!< 0x80000000 */
#define FLASH_PRIVBB2R4_PRIVBB31                      FLASH_PRIVBB2R4_PRIVBB31_Msk                      /*!< Page 127 in Flash bank 2 only accessible by privileged access */

